def str2hms(hms_str):
    # คนื จํานวนชั่วโมง นําที และวนิ ําที ทด่ี งึ มําจํากสตริง hms # เชน่ str2hms("10:03:29") ได้ 10,3,29 
    t = hms_str.split(':')
    return int(t[0]),int(t[1]),int(t[2])

def hms2str(h,m,s):
    # คนื สตรงิ ในรูปแบบ HH:MM:SS ทน่ี ําจํานวนช่ัวโมง นําที และวนิ ําทมี ําจําก h,m และ s # เชน่ hms2str(10,3,29) ได้ "10:03:29"
    return ('0'+str(h))[-2:] + ':' + \
            ('0'+str(m))[-2:] + ':' + \
            ('0'+str(s))[-2:]

def to_sec(h,m,s):
    # คนื จํานวนวนิ ําทที งั้ หมดนับจํากเทยี่ งคืนจํากถงึ เวลํา h:m:s # เชน่ to_sec(10,3,29) ได้ 36209
    return h*60*60 + m*60 + s

def to_hms(s):
    # คนื จํานวนชั่วโมง นําที และวนิ ําที ทหี่ ํามําจํากจํานวนวนิ ําที่ s ทัง้ หมดนับจํากเทย่ี งคนื # เชน่ to_hms(36209) ได้ 10,3,
    h = s // (60*60)
    s -= h*60*60
    m = s // 60
    s -= m*60
    return int(h), int(m), int(s)

def diff(h1,m1,s1,h2,m2,s2):
    # คนื จํานวนชั่วโมง นําที และวนิ ําท่ี จะเป็ นชว่ งเวลําตัง้ แต่เวลํา h1,m1,s1 จนถงึ h2,m2,s2 # เชน่ diff(10,57,57, 12,0,0) ได ้ 1,2,3
    # หมํายเหตุ เวลํา h1,m1,s1 ทไี่ ดร้ ับ ไม่มํากกว่ํา h2,m2,s2 แน่ ๆ
    # (เชน่ ไม่มกี รณีใหห้ ําชว่ งเวลําตัง้ แต่ 23,50,50 ถงึ 2,1,1 แน่ ๆ)
    ts1 = to_sec(h1,m1,s1)
    ts2 = to_sec(h2,m2,s2)
    dts = 0
    dts = ts2 - ts1
    h,m,s = to_hms(dts)
    return h,m,s #x, x, x


def main():
    # ฟังกช์ ันนี้รับเวลําเรมิ่ ตน้ และเวลําสน้ิ สุด ในรูปแบบ HH:MM:SS # เพ่ือแสดงชว่ งเวลําตัง้ แต่เรม่ิ จนถงึ สน้ิ สุด ในรูปแบบ HH:MM:SS # ดูตัวอย่ํางในตํารํางขํา้ งล่ําง
    hms_start = input()
    hms_end = input()
    h1,m1,s1 = str2hms(hms_start)
    h2,m2,s2 = str2hms(hms_end)
    h,m,s = diff(h1,m1,s1,h2,m2,s2)
    print(hms2str(h,m,s))

exec(input()) # DON'T remove this line